tests/songArtillery/getSongs.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 20
scenarios:
  - flow:
      - post:
          url: "/users"
          json:
            username: "Test"
            email: "test@example.com"
            password: "Password123"  
          capture:
            - json: $.token
              as: "token"
      - post:
          url: "/users/login"
          headers:
            Authorization: "Bearer {{token}}"
          json:
            email: "test@example.com"
            password: "Password123" 
      - get:
         url: "/songs"
         headers:
            Authorization: "Bearer {{token}}"